angularjs/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY created_at desc
---
  def index
    respond_with Tweet.order("created_at DESC")

INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "This is a test"], ["created_at", Mon, 18 Feb 2013 02:54:53 UTC +00:00], ["updated_at", Mon, 18 Feb 2013 02:54:53 UTC +00:00]]
---
  def create
    respond_with Tweet.create(params[:tweet])

DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 15]]
---
  def destroy
    respond_with Tweet.destroy(params[:id])