angularjs/tweets-with-routing/app/controllers/tweets_controller.rb

  def index
    respond_with Tweet.order("created_at DESC")
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at desc

  def create
    respond_with Tweet.create(params[:tweet])
---
INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "This is a test"], ["created_at", Mon, 18 Feb 2013 02:54:53 UTC +00:00], ["updated_at", Mon, 18 Feb 2013 02:54:53 UTC +00:00]]

  def destroy
    respond_with Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 15]]